/**
 * 正则表达式统计
 */
export const regex = {
  // 限制只允许输入允许输入中文、英文、数字
  NUM_EN_ZH: /^[A-z0-9\u4e00-\u9fa5]*$/,
  // 是否是中文
  CH: /[\u4E00-\u9FA5]/g,
  // 中文及全角字符
  SBC_CASE: /[\u3000-\u301e\ufe10-\ufe19\ufe30-\ufe44\ufe50-\ufe6b\uff01-\uffee]/,
  // IP规则校验
  IP: /^(\d+)\.(\d+)\.(\d+)\.(\d+)$/,
  // 密码校验：必须包含字母、数字、英文符号且8~20位
  PASSWORD: /^(?=.*\d)(?=.*[a-zA-Z])(?=.*[~!@#$%^&*])[\da-zA-Z~!@#$%^&*]{8,20}$/,
  // 为大于0或者正数，两位小数，其他符号不可输入
  MONEY_REGEX: /(^[1-9]{1}[0-9]*$)|(^[0-9]*\.[0-9]{2}$)/,
  // EMAIL
  EMAIL: /^([a-zA-Z0-9]+[_|\_|\.]?)*[a-zA-Z0-9]+@([a-zA-Z0-9]+[_|\_|\.]?)*[a-zA-Z0-9]+\.[a-zA-Z]{2,3}$/,
  // PHONENUMBER
  PHONE: /^(13[0-9]|14[5|7]|15[0-9]|17[0-9]|18[0-9]|19[0-9])\d{8}$/gi,
  // 空字符串
  EMPTY_REGEX: /^[ ]+$/,
  // 身份证
  IDENTITY: /^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$|^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}([0-9]|X)$/,
  // 支持英文、数字、中文、“-”、“_”，不能是纯数字
  USER_NAME_REGEX: /^(?!\d+$)[\da-zA-Z\u4e00-\u9fa5-_]*$/,
  // 中英文、数字及下划线(_)、斜线(/)、反斜线(\)、竖线(|)、 小括号(())、中括号([])组成
  DATASET_NAME_REGEX: /^[A-Za-z0-9\u4e00-\u9fa5_[\]\|/()\\]+$/
  // 中英文、数字及下划线(_)组成
  FOLDER_REGEX: /^[\u4e00-\u9fa5A-Za-z0-9_]+$/
}

export default regex
